#### Terraform Format and Style 
#### Terraform Initialization 
#### Terraform Validation 
#### Terraform Plan 📄

<details><summary>Show Plan</summary>

```hcl
module.cloudtrail.data.aws_caller_identity.current: Reading...
module.cloudtrail.data.aws_caller_identity.current: Read complete after 0s [id=211125325699]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alarm.aws_cloudwatch_metric_alarm.login_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "login_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers on AWS Console login attempts"
      + alarm_name                            = "ConsoleLoginAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ConsoleLoginEventCount"
      + namespace                             = "CloudTrailMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Environment" = "dev"
          + "Name"        = "ConsoleLoginAlarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Name"        = "ConsoleLoginAlarm"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudtrail.aws_cloudtrail.trail will be created
  + resource "aws_cloudtrail" "trail" {
      + arn                           = (known after apply)
      + cloud_watch_logs_group_arn    = (known after apply)
      + cloud_watch_logs_role_arn     = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "account-activity-trail"
      + s3_bucket_name                = (known after apply)
      + sns_topic_arn                 = (known after apply)
      + tags_all                      = (known after apply)
    }

  # module.cloudtrail.aws_cloudwatch_log_group.trail will be created
  + resource "aws_cloudwatch_log_group" "trail" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "demo-cloudtrail-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.cloudtrail.aws_iam_role.cloudtrail_role will be created
  + resource "aws_iam_role" "cloudtrail_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudtrail-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cloudtrail.aws_iam_role_policy.cloudtrail_policy will be created
  + resource "aws_iam_role_policy" "cloudtrail_policy" {
      + id          = (known after apply)
      + name        = "cloudtrail-cloudwatch-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.cloudtrail.aws_s3_bucket.trail_bucket will be created
  + resource "aws_s3_bucket" "trail_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "CloudTrailLogsBucket"
        }
      + tags_all                    = {
          + "Name" = "CloudTrailLogsBucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.cloudtrail.aws_s3_bucket_policy.trail_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "trail_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cloudtrail.random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.cloudwatch_logs.aws_cloudwatch_log_metric_filter.login_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "login_filter" {
      + id             = (known after apply)
      + log_group_name = "demo-cloudtrail-logs"
      + name           = "console-login-filter"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" }"

      + metric_transformation {
          + name      = "ConsoleLoginEventCount"
          + namespace = "CloudTrailMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.sns.aws_sns_topic.login_alerts will be created
  + resource "aws_sns_topic" "login_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "console-login-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.email_sub will be created
  + resource "aws_sns_topic_subscription" "email_sub" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "anilkumar.padarthi@hcltech.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @devops979, Action: `pull_request`*